from src.processing import filter_by_state, sort_by_date


def test_filter_by_state1(operations1: list) -> None:
    """
    Тестирует функцию фильтрации операций по состоянию.
    Проверяет работу с указанными состояниями.
    """
    assert filter_by_state(operations1) == [
        {"id": 41428829, "state": "EXECUTED", "date": "2019-07-03T18:35:29.512364"},
        {"id": 939719570, "state": "EXECUTED", "date": "2018-06-30T02:08:58.425572"},
    ]


def test_filter_by_state2(operations2: list) -> None:
    """
    Тестирует функцию фильтрации операций по состоянию.
    Проверяет работу с пропущенными состояниями.
    """
    assert filter_by_state(operations2) == [
        {"date": "2019-07-03T18:35:29.512364", "id": 41428829, "state": "EXECUTED"},
        {"date": "2018-06-30T02:08:58.425572", "id": 939719570},
        {"date": "201845310-1T408:2о:33.419441", "id": 615064591},
    ]


def test_filter_by_state3() -> None:
    """
    Тестирует функцию фильтрации операций по состоянию.
    Проверяет работу с указанием значения фильтрации.
    """
    assert filter_by_state(
        [
            {"id": 41428829, "state": "EXECUTED", "date": "2019-07-03T18:35:29.512364"},
            {"id": 939719570, "state": "CANCELED", "date": "2018-06-30T02:08:58.425572"},
            {"id": 594226727, "date": "2018-09-12T21:27:25.241689"},
            {"id": 615064591, "state": "CANCELED", "date": "2018-10-14T08:21:33.419441"},
        ],
        "CANCELED",
    ) == [
        {"date": "2018-06-30T02:08:58.425572", "id": 939719570, "state": "CANCELED"},
        {"date": "2018-09-12T21:27:25.241689", "id": 594226727},
        {"date": "2018-10-14T08:21:33.419441", "id": 615064591, "state": "CANCELED"},
    ]


def test_sort_by_date1(operations1: list) -> None:
    """
    Тестирует функцию сортировки операций по дате.
    Проверяет работу с корректными значениями.
    """
    assert sort_by_date(operations1) == [
        {"id": 41428829, "state": "EXECUTED", "date": "2019-07-03T18:35:29.512364"},
        {"id": 615064591, "state": "CANCELED", "date": "2018-10-14T08:21:33.419441"},
        {"id": 594226727, "state": "CANCELED", "date": "2018-09-12T21:27:25.241689"},
        {"id": 939719570, "state": "EXECUTED", "date": "2018-06-30T02:08:58.425572"},
    ]


def test_sort_by_date2(operations2: list) -> None:
    """
    Тестирует функцию сортировки операций по дате.
    Проверяет работу с некорректными значениями.
    """
    assert sort_by_date(operations2) == [
        {"date": "2019-07-03T18:35:29.512364", "id": 41428829, "state": "EXECUTED"},
        {"date": "2018-09-12T21:27:25.241689", "id": 594226727, "state": "CANCELED"},
        {"date": "2018-06-30T02:08:58.425572", "id": 939719570},
    ]


# Тест функции сортировки операций по дате в обратном порядке
def test_sort_by_date3() -> None:
    """
    Тестирует функцию сортировки операций по дате.
    Проверяет работу с корректными значениями в обратном порядке.
    """
    assert sort_by_date(
        [
            {"id": 41428829, "state": "EXECUTED", "date": "2019-07-03T18:35:29.512364"},
            {"id": 41428839, "state": "EXECUTED", "date": "2019-07-03T18:35:29.512364"},
            {"id": 594226727, "state": "CANCELED", "date": "2018-09-12T21:27:25.241689"},
            {"id": 615064591, "state": "CANCELED", "date": "2018-10-14T08:21:33.419441"},
        ],
        False,
    ) == [
        {"date": "2018-09-12T21:27:25.241689", "id": 594226727, "state": "CANCELED"},
        {"date": "2018-10-14T08:21:33.419441", "id": 615064591, "state": "CANCELED"},
        {"date": "2019-07-03T18:35:29.512364", "id": 41428829, "state": "EXECUTED"},
        {"date": "2019-07-03T18:35:29.512364", "id": 41428839, "state": "EXECUTED"},
    ]
